In [27]:
import numpy as np
import pandas as pd

In [28]:
# Mergeing 2 Datafreme

In [36]:
employees = pd.DataFrame({
    'Emp_id':[1,2,3,4,5],
    'Emp_name':['Qasim','Ali','Hassan','Mouzan','Awais'],
    'Emp_dep':['BSCS','PHY','IT','CHE','Finance']
    
})

salaries = pd.DataFrame({
    'Emp_id':[1,2,3,6,7],
    'salary':[90000,80000,70000,60000,50000],
    'bnous':[5000,6000,7000,8000,9000]
})

In [37]:
employees

   Emp_id Emp_name  Emp_dep
0       1    Qasim     BSCS
1       2      Ali      PHY
2       3   Hassan       IT
3       4   Mouzan      CHE
4       5    Awais  Finance

In [38]:
salaries

   Emp_id  salary  bnous
0       1   90000   5000
1       2   80000   6000
2       3   70000   7000
3       6   60000   8000
4       7   50000   9000

In [41]:
pd.merge(employees,salaries,on='Emp_id',how='inner')

   Emp_id Emp_name Emp_dep  salary  bnous
0       1    Qasim    BSCS   90000   5000
1       2      Ali     PHY   80000   6000
2       3   Hassan      IT   70000   7000

In [46]:
pd.merge(employees,salaries,on='Emp_id',how='outer')

   Emp_id Emp_name  Emp_dep   salary   bnous
0       1    Qasim     BSCS  90000.0  5000.0
1       2      Ali      PHY  80000.0  6000.0
2       3   Hassan       IT  70000.0  7000.0
3       4   Mouzan      CHE      NaN     NaN
4       5    Awais  Finance      NaN     NaN
5       6      NaN      NaN  60000.0  8000.0
6       7      NaN      NaN  50000.0  9000.0

In [47]:
pd.merge(employees,salaries,on='Emp_id',how='left')

   Emp_id Emp_name  Emp_dep   salary   bnous
0       1    Qasim     BSCS  90000.0  5000.0
1       2      Ali      PHY  80000.0  6000.0
2       3   Hassan       IT  70000.0  7000.0
3       4   Mouzan      CHE      NaN     NaN
4       5    Awais  Finance      NaN     NaN

In [48]:
pd.merge(employees,salaries,on='Emp_id',how='right')

   Emp_id Emp_name Emp_dep  salary  bnous
0       1    Qasim    BSCS   90000   5000
1       2      Ali     PHY   80000   6000
2       3   Hassan      IT   70000   7000
3       6      NaN     NaN   60000   8000
4       7      NaN     NaN   50000   9000

In [49]:
# Concatination of 2 Datafreame

In [50]:
df1 = pd.DataFrame({
    'A':['A1','A2','A3'], 
    'B':['B1','B2','B3'],
    'C':['C1','C2','C3'] 
})

df2 = pd.DataFrame({
    'A':['A4','A5','A6'], 
    'B':['B4','B5','B6'],
    'C':['C4','C5','C6'] 
})

In [51]:
df1

    A   B   C
0  A1  B1  C1
1  A2  B2  C2
2  A3  B3  C3

In [52]:
df2

    A   B   C
0  A4  B4  C4
1  A5  B5  C5
2  A6  B6  C6

In [53]:
pd.concat([df1,df2])

    A   B   C
0  A1  B1  C1
1  A2  B2  C2
2  A3  B3  C3
0  A4  B4  C4
1  A5  B5  C5
2  A6  B6  C6

Joining of 2 DATAFRAME

In [55]:
df1 = pd.DataFrame({
    'name':['Qasim','Ali','Mouzan'], 
},index=[1,2,3])

df2 = pd.DataFrame({
    'score':[85,50,75]
},index=[2,3,4])

In [56]:
df1

     name
1   Qasim
2     Ali
3  Mouzan

In [57]:
df2

   score
2     85
3     50
4     75

In [59]:
df1.join(df2,how='outer')

     name  score
1   Qasim    NaN
2     Ali   85.0
3  Mouzan   50.0
4     NaN   75.0

In [60]:
df2.join(df1,how='outer')

   score    name
1    NaN   Qasim
2   85.0     Ali
3   50.0  Mouzan
4   75.0     NaN